khoih-prog/ESP32_Ethernet_Manager/src/ESP32_Ethernet_Manager.hpp
#if USE_ESP_ETH_MANAGER_NTP
    
    inline String getTimezoneName() 
    {  
      return _timezoneName;
    }

    ///////////////////////////
 
    inline void setTimezoneName(const String& inTimezoneName) 
    {  
      _timezoneName = inTimezoneName;
    }

    ///////////////////////////
 
    //See: https://www.gnu.org/software/libc/manual/html_node/TZ-Variable.html
    // EST5EDT,M3.2.0,M11.1.0 (for America/New_York)
    // EST5EDT is the name of the time zone
    // EST is the abbreviation used when DST is off
    // 6 hours is the time difference from GMT
    // EDT is the abbreviation used when DST is on
    // ,M3 is the third month
    // .2 is the second occurrence of the day in the month
    // .0 is Sunday
    // ,M11 is the eleventh month
    // .1 is the first occurrence of the day in the month
    // .0 is Sunday   
    
    const char * getTZ(const char * timezoneName)
    {               
      //const char TZ_NAME[][TIMEZONE_MAX_LEN]
      for (uint16_t index = 0; index < sizeof(TZ_NAME) / TIMEZONE_MAX_LEN; index++)
      {
        if ( !strncmp(timezoneName, (TZ_NAME[index]), strlen((TZ_NAME[index])) ) )
        {
          yield();
          
          return (ESP_TZ_NAME[index]);            
        }    
      }
      
      return "";      
    }

    ///////////////////////////
      
    const char * getTZ(const String& timezoneName)
    {
      return getTZ(timezoneName.c_str());      
    }

    ///////////////////////////
     
#endif    
    
  private:
  
    std::unique_ptr<DNSServer>  dnsServer;

    std::unique_ptr<WebServer>  server;

    bool            needInfo = true;
    String          pager;
    wl_status_t     ethStatus;

#define RFC952_HOSTNAME_MAXLEN      24

    char RFC952_hostname[RFC952_HOSTNAME_MAXLEN + 1];

    char* getRFC952_hostname(const char* iHostname);

    void          setupConfigPortal();
    void          startWPS();

    ////////////////////////////////////////////////////

#if USE_ESP_ETH_MANAGER_NTP
    // Timezone info
    String        _timezoneName         = "";
#endif

    ////////////////////////////////////////////////////

    unsigned long _configPortalTimeout  = 0;

    unsigned long _connectTimeout       = 0;
    unsigned long _configPortalStart    = 0;
   
    ////////////////////////////////////////////////////
    
    ETH_STA_IPConfig _ETH_STA_IPconfig = { IPAddress(0, 0, 0, 0), IPAddress(192, 168, 2, 1), IPAddress(255, 255, 255, 0),
                                           IPAddress(192, 168, 2, 1), IPAddress(8, 8, 8, 8) };
   
    ////////////////////////////////////////////////////
    
    int           _paramsCount              = 0;
    int           _minimumQuality           = -1;
    bool          _removeDuplicateAPs       = true;
    bool          _shouldBreakAfterConfig   = false;
    bool          _tryWPS                   = false;

    const char*   _customHeadElement        = "";

    int           status                    = WL_IDLE_STATUS;
    
    // For configuring CORS Header, default to EM_HTTP_CORS_ALLOW_ALL = "*"
#if USING_CORS_FEATURE
    const char*     _CORS_Header            = EM_HTTP_CORS_ALLOW_ALL;   //"*";
#endif   
   
    wl_status_t   waitForConnectResult();
    
    void          setInfo();
    String        networkListAsString();
    
    void          handleRoot();
    void          handleETH();
    void          handleETHSave();
    void          handleServerClose();
    void          handleInfo();
    void          handleState();
    void          handleReset();
    void          handleNotFound();
    bool          captivePortal();   
       
    void          reportStatus(String& page);

    // DNS server
    const byte    DNS_PORT = 53;

    //helpers
    bool          isIp(const String& str);
    String        toStringIp(const IPAddress& ip);

    bool          connect;
    bool          stopConfigPortal = false;
    
    bool          _debug   = false;     //true;
    
    void(*_savecallback)() = NULL;

    ////////////////////////////////////////////////////

#if USE_DYNAMIC_PARAMS
    int                     _max_params;
    ESP32_EMParameter**  _params;
#else
    ESP32_EMParameter*   _params[ETH_MANAGER_MAX_PARAMS];
#endif

    ////////////////////////////////////////////////////

    template <class T>
    auto optionalIPFromString(T *obj, const char *s) -> decltype(obj->fromString(s)) 
    {
      return  obj->fromString(s);
    }

    ///////////////////////////
     
    auto optionalIPFromString(...) -> bool 
    {
      LOGINFO("No IPAddress.fromString(), use ESP8266 core 2.1.0+ for Custom IP configuration to work.");
      
      return false;
    }

    ///////////////////////////
     
};

#endif    // ESP32_Ethernet_Manager_hpp

